hw.org
#+title: אלגברה ליניארית

#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style>body{text-align:right}</style>

#+LATEX_HEADER: \usepackage[bidi=basic]{babel}
#+LATEX_HEADER: \babelprovide[main, import]{hebrew}
#+LATEX_HEADER: \babelfont{rm}{Libertinus Serif}
#+LATEX_COMPILER: lualatex
#+options: num:0




#+LATEX_HEADER: \usepackage[margin=1in]{geometry}		% For setting margins
#+LATEX_HEADER: \usepackage{amsmath}				% For Math
#+LATEX_HEADER: \usepackage{fancyhdr}				% For fancy header/footer
#+LATEX_HEADER: \usepackage{graphicx}				% For including figure/image
#+LATEX_HEADER: \usepackage{cancel}					% To use the slash to cancel out stuff in work
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \fancyhead[LO,L]{ברק דיקר }
#+LATEX_HEADER: \fancyhead[CO,C]{ECE305 - Homework Example}
#+LATEX_HEADER: \fancyhead[RO,R]{\today}
#+LATEX_HEADER: \fancyfoot[LO,L]{}
#+LATEX_HEADER: \fancyfoot[CO,C]{\thepage}
#+LATEX_HEADER: \fancyfoot[RO,R]{}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0.4pt}
#+LATEX_HEADER: \renewcommand{\footrulewidth}{0.4pt}

#+LATEX: \newpage
* שאלה 1
** סעיף א
יהי
\( A,B \in \mathbb{M} _{n*n} \)
מטריצות משולשות עליונות

הראו כי המטריצה
\( A+B \)
היא מטריצה משולשת
בעזרת שימוש באינדקסים
** סעיף ב
יהי
\( A,B \in \mathbb{M} _{n} \)
מטריצות משולשות עליונות

הראו כי המטריצה
\( A*B \)
היא מטריצה משולשת
בעזרת שימוש באינדקסים
* שאלה 2
יהי
\( A\in M_{2} (\mathbb{R}) \)
אם
\(A^2 = A \)
אז הערכים היחידים האפשריים עבור
\( tr(A) \)
הם
1,2,0
תנו דוגמאות למטריצות בהם הערכים האלה אכן מתקבלים
* שאלה 3
יהיו

\( A,B,C \in M_n(\mathbb{R})\)

מטריצות ריבועיות מסדר
\(n\)
על
\(n\)
ענו על הסעיפים הבאים

** סעיף א
הראו כי

\( tr(ABC) = tr(BCA) = tr(CAB) \)
** סעיף ב
תנו דוגמא שבה
\( tr(ABC) \neq tr(CBA) \)
מתקיים
** סעיף ג
הוכיחו שאם
\[A,B,C\]
מטריצות סימטריות אז גם
מתקיים
\[ tr(ABC) = tr(CBA) \]
* שאלה 4
יהיו
\(A,B\)
מטריצות סימטריות
** סעיף א
הראו כי
\(AB\)
סימטרית
אם ורק אם
\( AB-BA = 0 \)
מתקיים
** סעיף ב
הראו כי
\[ AB+BA \]
תמיד סימטרית
* שאלה 5
יהיו
\(A,B\)
מטריצות ריבועיות אנטי-סימטרית
** סעיף א
הראו כי
\(AB\)
אנטי סימטרית
אם ורק אם
\( AB+BA = 0 \)
מתקיים
** סעיף ב
הראו כי
\(AB-BA\)
תמיד אנטי סימטרית
* שאלה 6
יהי
\(A\)
מטריצה סימטרית
\(B\)
מטריצה אנטי-סמטרית

הראו כי
\[tr(AB) = 0 \]
