hw.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-25 Sun 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>אלגברה ליניארית</title>
<meta name="author" content="Barak-Nadav Diker" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">אלגברה ליניארית</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org719d89c">שאלה 1</a>
<ul>
<li><a href="#orgd06da1a">סעיף א</a></li>
<li><a href="#org58e40da">סעיף ב</a></li>
</ul>
</li>
<li><a href="#org5ebc622">שאלה 2</a></li>
<li><a href="#org8867718">שאלה 3</a>
<ul>
<li><a href="#orge646a52">סעיף א</a></li>
<li><a href="#org4ec85f6">סעיף ב</a></li>
<li><a href="#orgee33481">סעיף ג</a></li>
</ul>
</li>
<li><a href="#org3d3db50">שאלה 4</a>
<ul>
<li><a href="#orgce873d0">סעיף א</a></li>
<li><a href="#orgdeb1144">סעיף ב</a></li>
</ul>
</li>
<li><a href="#org3f01cb6">שאלה 5</a>
<ul>
<li><a href="#orge384028">סעיף א</a></li>
<li><a href="#orge9a0004">סעיף ב</a></li>
</ul>
</li>
<li><a href="#org35cb4e9">שאלה 6</a></li>
</ul>
</div>
</div>
<div id="outline-container-org719d89c" class="outline-2">
<h2 id="org719d89c">שאלה 1</h2>
<div class="outline-text-2" id="text-org719d89c">
</div>
<div id="outline-container-orgd06da1a" class="outline-3">
<h3 id="orgd06da1a">סעיף א</h3>
<div class="outline-text-3" id="text-orgd06da1a">
<p>
יהי
\( A,B \in \mathbb{M} _{n*n} \)
מטריצות משולשות עליונות
</p>

<p>
הראו כי המטריצה
\( A+B \)
היא מטריצה משולשת
בעזרת שימוש באינדקסים
</p>
</div>
</div>
<div id="outline-container-org58e40da" class="outline-3">
<h3 id="org58e40da">סעיף ב</h3>
<div class="outline-text-3" id="text-org58e40da">
<p>
יהי
\( A,B \in \mathbb{M} _{n} \)
מטריצות משולשות עליונות
</p>

<p>
הראו כי המטריצה
\( A*B \)
היא מטריצה משולשת
בעזרת שימוש באינדקסים
</p>
</div>
</div>
</div>
<div id="outline-container-org5ebc622" class="outline-2">
<h2 id="org5ebc622">שאלה 2</h2>
<div class="outline-text-2" id="text-org5ebc622">
<p>
יהי
\( A\in M_{2} (\mathbb{R}) \)
אם
\(A^2 = A \)
אז הערכים היחידים האפשריים עבור
\( tr(A) \)
הם
1,2,0
תנו דוגמאות למטריצות בהם הערכים האלה אכן מתקבלים
</p>
</div>
</div>
<div id="outline-container-org8867718" class="outline-2">
<h2 id="org8867718">שאלה 3</h2>
<div class="outline-text-2" id="text-org8867718">
<p>
יהיו
</p>

<p>
\( A,B,C \in M_n(\mathbb{R})\)
</p>

<p>
מטריצות ריבועיות מסדר
\(n\)
על
\(n\)
ענו על הסעיפים הבאים
</p>
</div>
<div id="outline-container-orge646a52" class="outline-3">
<h3 id="orge646a52">סעיף א</h3>
<div class="outline-text-3" id="text-orge646a52">
<p>
הראו כי
</p>

<p>
\( tr(ABC) = tr(BCA) = tr(CAB) \)
</p>
</div>
</div>
<div id="outline-container-org4ec85f6" class="outline-3">
<h3 id="org4ec85f6">סעיף ב</h3>
<div class="outline-text-3" id="text-org4ec85f6">
<p>
תנו דוגמא שבה
\( tr(ABC) \neq tr(CBA) \)
מתקיים
</p>
</div>
</div>
<div id="outline-container-orgee33481" class="outline-3">
<h3 id="orgee33481">סעיף ג</h3>
<div class="outline-text-3" id="text-orgee33481">
<p>
הוכיחו שאם
\[A,B,C\]
מטריצות סימטריות אז גם
מתקיים
\[ tr(ABC) = tr(CBA) \]
</p>
</div>
</div>
</div>
<div id="outline-container-org3d3db50" class="outline-2">
<h2 id="org3d3db50">שאלה 4</h2>
<div class="outline-text-2" id="text-org3d3db50">
<p>
יהיו
\(A,B\)
מטריצות סימטריות
</p>
</div>
<div id="outline-container-orgce873d0" class="outline-3">
<h3 id="orgce873d0">סעיף א</h3>
<div class="outline-text-3" id="text-orgce873d0">
<p>
הראו כי
\(AB\)
סימטרית
אם ורק אם
\( AB-BA = 0 \)
מתקיים
</p>
</div>
</div>
<div id="outline-container-orgdeb1144" class="outline-3">
<h3 id="orgdeb1144">סעיף ב</h3>
<div class="outline-text-3" id="text-orgdeb1144">
<p>
הראו כי
\[ AB+BA \]
תמיד סימטרית
</p>
</div>
</div>
</div>
<div id="outline-container-org3f01cb6" class="outline-2">
<h2 id="org3f01cb6">שאלה 5</h2>
<div class="outline-text-2" id="text-org3f01cb6">
<p>
יהיו
\(A,B\)
מטריצות ריבועיות אנטי-סימטרית
</p>
</div>
<div id="outline-container-orge384028" class="outline-3">
<h3 id="orge384028">סעיף א</h3>
<div class="outline-text-3" id="text-orge384028">
<p>
הראו כי
\(AB\)
אנטי סימטרית
אם ורק אם
\( AB+BA = 0 \)
מתקיים
</p>
</div>
</div>
<div id="outline-container-orge9a0004" class="outline-3">
<h3 id="orge9a0004">סעיף ב</h3>
<div class="outline-text-3" id="text-orge9a0004">
<p>
הראו כי
\(AB-BA\)
תמיד אנטי סימטרית
</p>
</div>
</div>
</div>
<div id="outline-container-org35cb4e9" class="outline-2">
<h2 id="org35cb4e9">שאלה 6</h2>
<div class="outline-text-2" id="text-org35cb4e9">
<p>
יהי
\(A\)
מטריצה סימטרית
\(B\)
מטריצה אנטי-סמטרית
</p>

<p>
הראו כי
\[tr(AB) = 0 \]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Barak-Nadav Diker</p>
<p class="date">Created: 2024-02-25 Sun 14:43</p>
</div>
</body>
</html>
